<a href="https://colab.research.google.com/github/datascience-projects-for-beginner/datascience-projects/blob/main/pandas_dataframe_using_dictionary.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [4]:
data = {
    'age':[21,22,25,27,30,36,40,42,43,50],
    'salary':[35000,50000,49000,70000,80000,85000,90000,100000,90000,150000]
}

df = pd.DataFrame(data)

df

   age  salary
0   21   35000
1   22   50000
2   25   49000
3   27   70000
4   30   80000
5   36   85000
6   40   90000
7   42  100000
8   43   90000
9   50  150000